Revit 2027 API
IFCParameterTemplate.ExportUserDefinedPropertySets Property
 The option to export user-defined property sets. If true, then all user-defined property sets not excluded will be exported. If false, then no user-defined property sets will be exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportUserDefinedPropertySets { get; set; }
Public Property ExportUserDefinedPropertySets As Boolean
	Get
	Set
public:
property bool ExportUserDefinedPropertySets {
	bool get ();
	void set (bool value);
}
member ExportUserDefinedPropertySets : bool with get, set
Property Value
Boolean
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace